[
    {
        "university": "The University of Cape Town",
        "description": " The University of Cape Town (UCT) is a public research university located in Cape Town in the Western Cape province of South Africa. UCT was founded in 1829 as the South African College, and is the oldest university in South Africa and the second oldest extant university in Africa. The language of instruction is English",
        "page_links": "www.uct.ac.za/",
        "img_links": "https://i2.wp.com/africauniversities.org/wp-content/uploads/2015/01/south_african_universities.png?resize=83%2C85"
    },
    {
        "university": "Stellenbosch University",
        "description": "Stellenbosch University (SU) is striving towards a welcoming campus culture that will make all students, staff and visitors feel at home, irrespective of origin, ethnicity, language, gender, religious  Stellenbosch University has ten faculties: AgriSciences, Economic and Management Sciences, Medical and Health Sciences, Engineering, Military Sciences, Arts and Social Sciences, Economic and Management Sciences, Law, Engineering and Education",
        "page_links": "www.sun.ac.za/english/",
        "img_links": "https://i1.wp.com/africauniversities.org/wp-content/uploads/2015/01/stellenbosch_university.jpg?resize=66%2C74"
    },
    {
        "university": "University of Pretoria",
        "description": "Established in 1908, the University of Pretoria is a multi-campus public research university in Pretoria. The University is organised into nine faculties and a business school. Established in 1920, the University of Pretoria   Faculty of Veterinary Science   is the second oldest veterinary school in Africa and the only veterinary school in South Africa",
        "page_links": "www.up.ac.za/",
        "img_links": "https://i0.wp.com/africauniversities.org/wp-content/uploads/2015/01/SA.jpg?resize=79%2C124"
    },
    {
        "university": "University of the Witwatersrand",
        "description": "The University of the Witwatersrand, Johannesburg, is a multi-campus South African public research university situated in the northern areas of central Johannesburg. It is more commonly known as Wits University. Wits University contributes to the global knowledge economy and local transformation through generating high level, scarce skills and innovative research. The South African University has 5 faculties, Commerce, Law and Management; Health Sciences; Humanities and Science",
        "page_links": "www.wits.ac.za/",
        "img_links": "https://i1.wp.com/africauniversities.org/wp-content/uploads/2015/01/South-African-universities.jpg?resize=48%2C88"
    },
    {
        "university": "University of Kwazulu Natal",
        "description": "The University of KwaZulu-Natal or UKZN is a university with five campuses all located in the province of KwaZulu-Natal in South Africa. A truly South African university that is academically excellent, innovative in research, critically engaged with society and demographically representative, redressing the disadvantages, inequities and imbalances of the past",
        "page_links": "www.ukzn.ac.za/",
        "img_links": "https://i1.wp.com/africauniversities.org/wp-content/uploads/2015/01/South-African-universities.png?resize=107%2C100"
    },
    {
        "university": "University of the Western Cape",
        "description": "The University of the Western Cape is a public university located in the Bellville suburb of Cape Town, South Africa.  In its mission, the University  of the Western Cape strives to be a place of quality, a place to grow.     The University of The Western Cape has grown to become one of the best universities in South Africa",
        "page_links": "www.uwc.ac.za/Pages/default.aspx",
        "img_links": "https://i2.wp.com/africauniversities.org/wp-content/uploads/2015/01/South-African-universities1.jpg?resize=68%2C83"
    },
    {
        "university": "Rhodes University",
        "description": "Rhodes University is a public research university located in Grahamstown in the Eastern Cape Province of South Africa, established in 1904. It is the province s oldest university, and is one of the four universities in the province. Rhodes has six faculties: Humanities, Commerce, Law, Science, Education and Pharmacy",
        "page_links": "www.ru.ac.za/",
        "img_links": "https://i1.wp.com/africauniversities.org/wp-content/uploads/2015/01/South-African-universities2.jpg?resize=85%2C90"
    },
    {
        "university": "The University of South Africa",
        "description": "The University of South Africa is the largest university on the African continent and attracts a third of all higher education students in South Africa. UNISA  has a reputable, comprehensive, flexible and accessible open distance learning institution that is motivating a future generation. We offer internationally accredited qualifications and have world-class resources",
        "page_links": "www.unisa.ac.za/default.html",
        "img_links": "https://i0.wp.com/africauniversities.org/wp-content/uploads/2015/01/South-African-universities1.png?resize=176%2C38"
    },
    {
        "university": "University of Johannesburg",
        "description": "The University of Johannesburg (UJ) is a public university located in Johannesburg, South Africa. The newly emerged institution is one of the largest comprehensive contact universities in South Africa, with nine faculties having more than 90 departments and an enrollment of approximately 48,000 students, spreading over four different campuses. The university is one of the largest residential universities in the Republic of South Africa",
        "page_links": "www.uj.ac.za/EN/Pages/home.aspx",
        "img_links": "https://i2.wp.com/africauniversities.org/wp-content/uploads/2015/01/South-African-universities2.png?resize=160%2C44"
    },
    {
        "university": "North West University",
        "description": "As a multi-campus university, the NWU offers students choice and variety, both academically and geographically. Collectively, the three campuses have 15 academic faculties, which in turn consist of more than 50 schools. Some faculties also have centres and institutes offering short courses, other types of skills development and various community and commercial services.  NWU Vaal focuses on programmes in economic sciences, commerce, information technology, education, social science, languages and the humanities",
        "page_links": "www.nwu.ac.za/",
        "img_links": "https://i1.wp.com/africauniversities.org/wp-content/uploads/2015/01/South-African-universities3.jpg?resize=129%2C91"
    },
    {
        "university": "University of the Free State",
        "description": "The University of the Free State is a multi campus public university in Bloemfontein, the capital of the Free State. As part of the mission to become  a university recognised across the world for excellence in academic achievement and in human reconciliation , the university, its staff, students and alumni play a pivotal role in the central parts of South Africa, the country as a whole, the region, Africa and abroad.  Academic Divisions include: Economic and Management Sciences, Education, Health Sciences, Law, Natural and Agricultural Sciences, Humanities and Theology",
        "page_links": "www.ufs.ac.za/",
        "img_links": "https://i2.wp.com/africauniversities.org/wp-content/uploads/2015/01/South-African-universities.gif?resize=74%2C71"
    },
    {
        "university": "Nelson Mandela Metropolitan University",
        "description": "Nelson Mandela Metropolitan University (NMMU) is a South African tertiary education institution with its main administration in the coastal city of Port Elizabeth. NMMU is a comprehensive university offering professional and vocational training. The University has six campuses   five in Port Elizabeth and one in George",
        "page_links": "www.nmmu.ac.za/",
        "img_links": "https://i0.wp.com/africauniversities.org/wp-content/uploads/2015/01/South-African-universities4.jpg?resize=155%2C63"
    },
    {
        "university": "Cape Peninsula University of Technology",
        "description": "The Cape Peninsula University of Technology is at the heart of technology education and innovation in Africa. An internationally acclaimed institution, it is the only university of technology in the Western Cape and is the largest university in the region with an enrolment of more than 30 000 students. The university has six faculties offering a wide range of accredited undergraduate and postgraduate courses in the fields of Applied Sciences, Business, Education and Social Sciences, Engineering, Informatics and Design as well as Health and Wellness Sciences",
        "page_links": "www.cput.ac.za/",
        "img_links": "https://i0.wp.com/africauniversities.org/wp-content/uploads/2015/01/South-African-universities5.jpg?resize=176%2C67"
    },
    {
        "university": "Durban University of Technology",
        "description": "With approximately 23 000 students, the Durban University of Technology (DUT) is the first choice for higher education in KwaZulu-Natal (KZN). It is located in the beautiful cities of Durban and Pietermaritzburg (PMB). As a University of Technology, it prioritises the quality of teaching and learning by ensuring its academic staff possess the highest possible qualification that they can get",
        "page_links": "www.dut.ac.za/",
        "img_links": "https://i1.wp.com/africauniversities.org/wp-content/uploads/2015/01/South-African-universities6.jpg?resize=105%2C84"
    },
    {
        "university": "University of Zululand",
        "description": "The University of Zululand is the only comprehensive tertiary educational institution north of the Tugela River in KwaZulu-Natal, South Africa.Unizulu offers career-focused programmes as well as a limited number of relevant university degree courses that have been structured with potential employees and employers in mind. Programs are offered within four faculties: Arts, Commerce, administration and law, Education and Science and agriculture",
        "page_links": "www.uzulu.ac.za/",
        "img_links": "https://i1.wp.com/africauniversities.org/wp-content/uploads/2015/01/South-African-universities7.jpg?resize=81%2C97"
    },
    {
        "university": "Monash University",
        "description": "Monash University opened in 2001 and was the first foreign university established in South Africa. The university is located on a 100 hectare site in Ruimsig in north-west Johannesburg. Monash offers foundation, undergraduate, honours and postgraduate course options",
        "page_links": "www.monash.ac.za/",
        "img_links": "https://i1.wp.com/africauniversities.org/wp-content/uploads/2015/01/South-African-universities8.jpg?resize=83%2C76"
    },
    {
        "university": "Vaal University of Technology",
        "description": "Vaal University of Technology is a tertiary institution in South Africa and attracts students from all over the country.  It is one of the largest residential Universities of Technology, with about 15,000 students, 300 programs, all primarily taught in English. The campus and facilities are conducive to learning, research, recreation and sport, art and culture, and community service",
        "page_links": "www.vut.ac.za/",
        "img_links": "https://i2.wp.com/africauniversities.org/wp-content/uploads/2015/01/South-African-universities3.png?resize=58%2C88"
    },
    {
        "university": "Central University of Technology",
        "description": "Central University of Technology is based in Bloemfontein in the Free State province of South Africa and was established in 1981. The Central University of Technology employs over 800 academic and research staff spread across four faculties: Faculty of Engineering and Information Technology;  Faculty of Health and Environmental Sciences; Faculty of Humanities; Faculty of Management Sciences and General description for Africa Universities site",
        "page_links": "www.cut.ac.za/",
        "img_links": "https://i1.wp.com/africauniversities.org/wp-content/uploads/2015/01/South-African-universities9.jpg?resize=99%2C92"
    },
    {
        "university": "Walter Sisulu University",
        "description": "Walter Sisulu University is a university of technology and science in Mthatha, Eastern Cape, South Africa, which came into existence on 1 July 2005. WSU is a developmental university, focusing on urban renewal and rural development by responding to the socio-economic needs of community, commerce and industry through science, technology and innovation. The university is organised by faculty: Faculty of Science, Engineering and Technology; Faculty of Health Sciences; Faculty of Business, Management Sciences & Law; Faculty of Education",
        "page_links": "www.wsu.ac.za/waltersisulu/",
        "img_links": "https://i0.wp.com/africauniversities.org/wp-content/uploads/2015/01/South-African-universities10.jpg?resize=166%2C67"
    },
    {
        "university": "University of Limpopo",
        "description": "The University of Limpopo is a public university in the Limpopo Province, South Africa and was formed in 2005. The Campus is situated to the north-west of Pretoria. Its grounds extend over some 350 ha adjoining the Ga-Rankuwa Township and are easily accessible by roads and rail",
        "page_links": "www.ul.ac.za/index.php?Entity=Home",
        "img_links": "https://i0.wp.com/africauniversities.org/wp-content/uploads/2015/01/South-African-universities4.png?resize=100%2C82"
    },
    {
        "university": "Tshwane University of Technology",
        "description": "Tshwane University of Technology (TUT) is a public higher education institution in South Africa that to life in 2004. As the number of students registering annually grows rapidly, records show that Tshwane University of Technology caters for approximately 60,000 students and it has become the largest residential higher education institution in South Africa",
        "page_links": "www.tut.ac.za/",
        "img_links": "https://i0.wp.com/africauniversities.org/wp-content/uploads/2015/01/South-African-universities2.gif?resize=156%2C84"
    },
    {
        "university": "University of Fort Hare",
        "description": "The University of Fort Hare is a public university in Alice, Eastern Cape, South Africa. The 5 faculties include: Education; Science & Agriculture; Social Sciences & Humanities; Management & Commerce; Law. The staff are committed to helping students fulfill diverse needs and in the process development, responsibility, and accountability are promoted",
        "page_links": "www.ufh.ac.za/",
        "img_links": "https://i2.wp.com/africauniversities.org/wp-content/uploads/2015/01/South-African-universities5.png?resize=116%2C87"
    }
]